reddit_clone/app/views/posts/new.html.erb

  <label>Subs
    <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"