reddit_clone/app/controllers/subs_controller.rb

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "This is our first test sub edited"], ["updated_at", "2019-09-10 16:17:33.075821"], ["id", 1]]
---
  def update
    @sub = Sub.find(params[:id])
    if @sub.moderator_id == current_user.id && @sub.update(sub_params)